<?php

$a = rand(-10, 10);
$b = rand(-10, 10);

echo '$a = ' . "$a" . '<br>';
echo '$b = ' . "$b" . '<br>';
?>

<p>если $a и $b положительные, вывести их разность;</p>
<p>если $а и $b отрицательные, вывести их произведение;</p>
<p>если $а и $b разных знаков, вывести их сумму;</p>

<?php
if ($a >= 0 && $b >= 0) {
    echo '$a - $b = ' . ("$a" - "$b");
} else if ($a < 0 && $b < 0) {
    echo '$a * $b = ' . ("$a" * "$b");
} else if ($a >= 0 && $b < 0 || $a < 0 && $b >= 0) {
    echo '$a + $b = ' . ("$a" + "$b");
}